{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"Supervisor 配置nodejs的环境变量","text":"Supervisor 是一个客户端/服务器系统，允许其用户监视和控制类UNIX操作系统上的许多进程。 12345678[program:my-api]command=node /home/myuser/myapi/app.js autostart=true autorestart=true environment=NODE_ENV=production stderr_logfile=/var/log/myapi.err.log stdout_logfile=/var/log/myapi.out.log user=myuser 别忘记update","link":"/2019/06/28/Supervisor-配置nodejs的环境变量/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/06/28/hello-world/"},{"title":"南亚古丝路上的明珠-亚东","text":"亚东，系藏语，意为“漩谷，急流深谷”，位于喜马拉雅山脉中段，历史上曾隶属于帕里宗，旅游资源非常丰富，概括为：“一泉两寺、一湖一山、一草一木”，即康布温泉，东嘎寺、嘎居寺、多情湖、卓木拉日雪山、帕里草原和下亚东原始森林。 地理位置亚东距离拉萨460公里，东边接着不丹，距离不丹首都廷布直线距离50公里；西边挨着印度，再往西是尼泊尔，若算上独立时的锡金王国，亚东一县之地与四国为邻，位置得天独厚。位于亚东县城17公里处的仁青岗边贸市场所在的乃堆拉山口，曾一直是“茶马古道”和“丝绸之路”南线的主要通道，但自62年中印边境冲突后，边贸中断，直至06年才重新开放。 自然风光从江孜进康马往南，山谷逐渐开阔，两侧山体仿佛打开了一扇大门，卓木拉日雪山矗立在地平线尽头，洁白圣洁，肆意昂首，像是盘踞在高原的一条巨龙。当地人们也叫她神女峰，连通和她一起的七座雪山称为七仙女。人们说卓木拉日雪山是干城章嘉的妻子，不过他们之间距离有百来公里，分居两地，隔着连绵的群山凝望，山盟海誓说的就是他们吧。 在七仙女雪山脚下，孕育着一个浅浅的湖泊，她有一个好听的音译名，叫多情错，多情错湖水不深，湖边和浅水处，水草丰茂，起风时，五颜六色的水草跟着湖水轻轻摇摆，湖面一会变成草原，一会变成林海，仿佛一幅画板。在湖水平静的时候，七仙女雪山倒影在湖面上，就像是梳妆打扮的少女。 人文历史 在古代，卓木山谷是西藏通向印度通道。据说在1300年前，松赞干布曾带兵从这里到过南方平原，佛教也是通过这条路，从印度传到了西藏。因为独特的地址位置，慢慢发展为马帮的休息地，逐渐形成了集市、小镇。 英军入境1849年，英国征服印度全境，1865年，锡金和不丹都被英国纳入殖民势力范围，在锡金大举修路，意图谋西藏。 光绪30年（1904年），英军统帅荣赫鹏率千余英国军人占领岗巴宗，堆纳，进攻江孜，进而入侵拉萨，噶厦着驻藏大臣有泰同英方议和的命令，派出拉丁色和朗色林二代本率军开赴多情错西北的曲美雄谷一带布防，阻止英军进犯。英军见藏军防备完善，加上其高原反应严重，提出谈判。3月31日，拉丁色和朗色林离开阵地同英军谈判，而英军偷偷向藏军阵地推进，在谈判进行之时，藏军已被英军包围。英军谈判代表声称：既然要议和，为表诚意，英军先将子弹退出枪膛，也要求藏军指挥官下令将火枪的点火线熄灭，藏军按协议将土枪点火线全部熄灭，英军则在退枪膛一刹那又将子弹上了膛。荣赫鹏佯装谈判，拖住藏军指挥官，麦克唐纳则指挥英军强迫藏军缴械，冲突中，英方开火，藏军武器落后，使用的都是土枪、大刀、抛石鞭等。在机枪和大炮的扫射轰击下，英军进行了残酷的屠杀。共有1400多名藏军牺牲，仅380人逃出。 曲美雄谷大屠杀曲美雄谷大屠杀，激起了藏族军民的怒火，英军在向江孜前进途中，沿途群众自发组织拦击。此后在杂昌古地、帕拉村伏击战、乃宁寺阻击战、江孜保卫战中西藏军民奋勇抵抗，誓死不屈，直至全部阵亡。电影《红河谷》讲述的就是这个故事。 而今，雪山河谷依旧，傲然屹立的曲美雄谷纪念碑，在向过往行人诉说着曾经惨烈的历史。警示今天的我们勿忘历史，勿忘耻辱。 在堆纳乡不远处，矗立着一个图腾般的血红色大门，顶着一个太阳般的圆盘，像是一个祭祀用的法器，如同宗教法场一般，在神圣的雪山脚下，暗红色的大门显得的有点神秘，这就是曲美雄谷纪念碑。这座纪念碑孤独的与雪山相伴，与长空相望，向人们诉说，发生在这块高原大地的血泪往事。 英军入侵拉萨之后，《拉萨条约》签订，将亚东等地开辟为商埠，之后建立邮电站，下司马镇愈加热闹繁荣。亚东逐渐成为西藏重要物资进口中心。 商埠繁荣1947年印度独立后，乃堆拉山口的贸易发展迅速。10年后，上千头骡马每天往返在这条道路上。西藏的羊毛、动物皮革通过乃堆拉山口进入印度，印度来的衣物、烟草、肥皂、劳力士手表，进入亚东，销往西藏各地。十四世达赖喇嘛当年有一辆吉普车，就是拆成零件，由马帮驮运到拉萨再组装起来的。在江孜的帕拉庄园的女主人房里，进口化妆品，咖啡、上海的美女广告画，欧洲的名贵手表等等，一样也不缺。 解放后-仁青岗边贸市场1951年，西藏和平解放，1954年，中印两国政府签订协定，取消英国人在西藏遗留的问题。 印度放弃了继承英国侵略中国西藏时的特权，承认中国对西藏的主权。1957年6月，中国在亚东完全行使主权。 1962年，中印边境冲突，亚东商埠关闭。2006年，关闭44年的乃堆拉山口重开，从中国的仁青岗边贸市场到印度的昌古边贸市场，再次排起了车马。 经过几年的发展，亚东县成为了日喀则有名的经济强县。下司马镇的白天夜晚，印度的香水，纺织品，工艺品，随处可见；街道人来人往，时装店，蛋糕店，音像店里人流不息。银行，高楼、酒店一排排，让人忘记身在西藏。 参考资料：亚东县-百科 西藏亚东地区边界历史演变与地缘战略分析","link":"/2019/06/28/南亚古丝路上的明珠-亚东/"}],"tags":[{"name":"Supervisor","slug":"Supervisor","link":"/tags/Supervisor/"},{"name":"NodeJS","slug":"NodeJS","link":"/tags/NodeJS/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"游记","slug":"游记","link":"/tags/游记/"}],"categories":[{"name":"NodeJS","slug":"NodeJS","link":"/categories/NodeJS/"},{"name":"游记","slug":"游记","link":"/categories/游记/"}]}